In [4]:
import pandas as pd
dict = {
    "name": ["Samir","Ratul", "Bijoy"],
    "Age": [23,34,15],
    "Blood Group": ["B+","A-","O-"],
    "Height": [5.3,5.7,6.2] 
}

In [6]:

df = pd.DataFrame(dict)

In [7]:
df

    name  Age Blood Group  Height
0  Samir   23          B+     5.3
1  Ratul   34          A-     5.7
2  Bijoy   15          O-     6.2

In [12]:

type(df['Age'])

pandas.core.series.Series

In [66]:
df['Age']

0    23
1    34
2    15
Name: Age, dtype: int64

In [11]:
df[['Age']]

   Age
0   23
1   34
2   15

In [14]:
type(df[['Age']])

pandas.core.frame.DataFrame

In [23]:
age_bellow_25 = df[['Age']]<25

# type(age_bellow_25)
age_bellow_25

     Age
0   True
1  False
2   True

In [28]:
age_bellow_25 = df['Age']<25
age_bellow_25
# type(age_bellow_25)

0     True
1    False
2     True
Name: Age, dtype: bool

In [47]:
age_bellow_25 = df[df['Age']<25] 
age_bellow_25

    name  Age Blood Group  Height
0  Samir   23          B+     5.3
2  Bijoy   15          O-     6.2

In [48]:
df

    name  Age Blood Group  Height
0  Samir   23          B+     5.3
1  Ratul   34          A-     5.7
2  Bijoy   15          O-     6.2

In [53]:
df.head()

    name  Age Blood Group  Height
0  Samir   23          B+     5.3
1  Ratul   34          A-     5.7
2  Bijoy   15          O-     6.2

In [56]:
df[['Age']]

   Age
0   23
1   34
2   15

In [63]:
df[['Blood Group']]

  Blood Group
0          B+
1          A-
2          O-

In [64]:
df[['Blood Group','Age']]

  Blood Group  Age
0          B+   23
1          A-   34
2          O-   15

In [61]:
df['Age'][2]

np.int64(15)

In [67]:
df

    name  Age Blood Group  Height
0  Samir   23          B+     5.3
1  Ratul   34          A-     5.7
2  Bijoy   15          O-     6.2

In [68]:
df[0:2]

    name  Age Blood Group  Height
0  Samir   23          B+     5.3
1  Ratul   34          A-     5.7

In [69]:
df[['name']]

    name
0  Samir
1  Ratul
2  Bijoy

In [70]:
df['name']

0    Samir
1    Ratul
2    Bijoy
Name: name, dtype: object

In [71]:
len(df['name'])

3

In [72]:
df['name']

0    Samir
1    Ratul
2    Bijoy
Name: name, dtype: object

In [73]:
df[['name']]

    name
0  Samir
1  Ratul
2  Bijoy

In [75]:
df['name'][0]

'Samir'

In [ ]:
df[